import { DataTypes } from "sequelize";
import sequelize from "../config/db.js";

const App = sequelize.define('App', {
    id: {
        type: DataTypes.INTEGER,
        primaryKey: true,       // Указываем, что это первичный ключ
        autoIncrement: true,    // Включаем автоинкремент (автоувеличение)
        allowNull: false,
    },
    name: {
        type: DataTypes.STRING,
        allowNull: false,       // Обязательное поле для имени
    },
    size: {
        type: DataTypes.INTEGER,
        allowNull: false,       // Обязательное поле для размера 
    }
}, {
    tableName: 'Apps',          // Явно указали имя таблицы с большой буквы
    timestamps: false,          // Отключили автоматические createdAt и updatedAt
});

export default App;

// Задание 4
// Создание и настройка модели `App`
// 1 Создание файла модели:
// Перейдите в директорию `models` и создайте новый файл с именем `App.js`.
// В этом файле определите модель `App`, которая будет представлять данные в таблице базы данных. Укажите необходимые столбцы: `id`, `name`, и `size`.
// 2 Описание столбцов модели:
// В модели `App` определите следующие столбцы:
// `id` — идентификатор, который будет автоматически увеличиваться для каждой новой записи и будет первичным ключом.
// `name` — строка, представляющая имя приложения. Поле обязательно для заполнения.
// `size` — число, представляющее вес приложения. Поле также обязательно для заполнения.
// 3 Дополнительные настройки модели:
// Настройте дополнительные параметры модели:
// Явно укажите имя таблицы в базе данных (`Apps`).
// Отключите автоматическое добавление полей `createdAt` и `updatedAt`, если они вам не нужны.
// 4 Экспорт модели:
// Экспортируйте модель `App`, чтобы она могла быть использована в других частях вашего приложения для взаимодействия с базой данных.


// Задание 5
// Создание и настройка миграции для модели `App`
// 1 Генерация миграции:
// В терминале выполните команду для генерации новой миграции, которая будет создавать таблицу для модели `App`. Команда должна быть подобной `npx sequelize-cli migration:generate --name create-apps-table`.
// Эта команда создаст новый файл миграции в папке `migrations`.
// 2 Редактирование файла миграции:
// Перейдите в директорию `migrations` и найдите созданный файл миграции. Откройте его для редактирования.
// В секции `up` добавьте код для создания таблицы `Apps` в базе данных, с указанием всех столбцов (`id`, `name`, `size`) и их типов данных.
// В секции `down` добавьте код для удаления таблицы `Apps`, чтобы миграцию можно было откатить.
// 3 Применение миграции:
// После настройки файла миграции выполните команду `npx sequelize-cli db:migrate`, чтобы применить миграцию и создать таблицу `Apps` в базе данных.
// 4 Проверка результата:
// Перейдите в MySQL Workbench и проверьте, что таблица `Apps` действительно создалась.